In [4]:
import numpy as np
import pandas as pd
df = pd.DataFrame({"id":[1001,1002,1003,1004,1005,1006], 
                   "date":pd.date_range('20130102', periods=6),
                   "city":['Beijing ', 'SH', ' guangzhou ', 'Shenzhen', 'shanghai', 'BEIJING '],
                   "age":[23,44,54,32,34,32],
                   "category":['100-A','100-B','110-A','110-C','210-A','130-F'],
                   "price":[1200,np.nan,2133,5433,np.nan,4432]},
                   columns =['id','date','city','category','age','price'])

In [5]:
df

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
1  1002 2013-01-03           SH    100-B   44     NaN
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
4  1005 2013-01-06     shanghai    210-A   34     NaN
5  1006 2013-01-07     BEIJING     130-F   32  4432.0

##数据表检查

#查看数据表的维度

In [6]:
#查看数据表维度
df.shape

(6, 6)

In [7]:
#查看数据表信息
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
id          6 non-null int64
date        6 non-null datetime64[ns]
city        6 non-null object
category    6 non-null object
age         6 non-null int64
price       4 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(2)
memory usage: 368.0+ bytes

In [8]:
#查看数据表各列格式
df['price'].dtype

dtype('float64')

In [9]:
#查看单列格式
df.dtypes

id                   int64
date        datetime64[ns]
city                object
category            object
age                  int64
price              float64
dtype: object

In [10]:
#检查数据空值
df.isnull()

      id   date   city category    age  price
0  False  False  False    False  False  False
1  False  False  False    False  False   True
2  False  False  False    False  False  False
3  False  False  False    False  False  False
4  False  False  False    False  False   True
5  False  False  False    False  False  False

In [11]:
#检查特定列空值
df['price'].isnull()

0    False
1     True
2    False
3    False
4     True
5    False
Name: price, dtype: bool

In [12]:
#查看city列中的唯一值------------------------------------
df['city'].unique()

array(['Beijing ', 'SH', ' guangzhou ', 'Shenzhen', 'shanghai', 'BEIJING '], dtype=object)

In [13]:
#查看数据表的值
df.values

array([[1001, Timestamp('2013-01-02 00:00:00'), 'Beijing ', '100-A', 23,
        1200.0],
       [1002, Timestamp('2013-01-03 00:00:00'), 'SH', '100-B', 44, nan],
       [1003, Timestamp('2013-01-04 00:00:00'), ' guangzhou ', '110-A', 54,
        2133.0],
       [1004, Timestamp('2013-01-05 00:00:00'), 'Shenzhen', '110-C', 32,
        5433.0],
       [1005, Timestamp('2013-01-06 00:00:00'), 'shanghai', '210-A', 34,
        nan],
       [1006, Timestamp('2013-01-07 00:00:00'), 'BEIJING ', '130-F', 32,
        4432.0]], dtype=object)

In [14]:
#查看列名称
df.columns

Index(['id', 'date', 'city', 'category', 'age', 'price'], dtype='object')

In [15]:
#查看前3行数据
df.head(3)

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
1  1002 2013-01-03           SH    100-B   44     NaN
2  1003 2013-01-04   guangzhou     110-A   54  2133.0

In [16]:
#查看最后3行
df.tail(3)

     id       date      city category  age   price
3  1004 2013-01-05  Shenzhen    110-C   32  5433.0
4  1005 2013-01-06  shanghai    210-A   34     NaN
5  1006 2013-01-07  BEIJING     130-F   32  4432.0

In [17]:
#删除数据表中含有空值的行
df.dropna()

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
5  1006 2013-01-07     BEIJING     130-F   32  4432.0

In [18]:
#使用数字0填充数据表中空值
df.fillna(0)

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
1  1002 2013-01-03           SH    100-B   44     0.0
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
4  1005 2013-01-06     shanghai    210-A   34     0.0
5  1006 2013-01-07     BEIJING     130-F   32  4432.0

In [19]:
#使用price均值对NA进行填充
df.fillna(df['price'].mean())

     id       date         city category  age   price
0  1001 2013-01-02     Beijing     100-A   23  1200.0
1  1002 2013-01-03           SH    100-B   44  3299.5
2  1003 2013-01-04   guangzhou     110-A   54  2133.0
3  1004 2013-01-05     Shenzhen    110-C   32  5433.0
4  1005 2013-01-06     shanghai    210-A   34  3299.5
5  1006 2013-01-07     BEIJING     130-F   32  4432.0

In [20]:
#清除city字段中的字符空格
df['city'] = df['city'].map(str.strip)

In [21]:
#city列大小写转换
df['city'].map(str.title)

0      Beijing
1           Sh
2    Guangzhou
3     Shenzhen
4     Shanghai
5      Beijing
Name: city, dtype: object

In [22]:
#更改price列数据格式
#需要注意fillna方法返回的是一个DataFrame,不是一列数字,若要修改数据,需要赋值给DataFrame,而不是某一列
df= df.fillna(df['price'].mean())
df['price'].astype('int')

0    1200
1    3299
2    2133
3    5433
4    3299
5    4432
Name: price, dtype: int32

In [23]:
#更改列名称
df.rename(columns = {'category':'catecory-size2'})

     id       date       city catecory-size2  age   price
0  1001 2013-01-02    Beijing          100-A   23  1200.0
1  1002 2013-01-03         SH          100-B   44  3299.5
2  1003 2013-01-04  guangzhou          110-A   54  2133.0
3  1004 2013-01-05   Shenzhen          110-C   32  5433.0
4  1005 2013-01-06   shanghai          210-A   34  3299.5
5  1006 2013-01-07    BEIJING          130-F   32  4432.0

In [24]:
#删除city列后出现的重复值
df['city'] = df['city'].map(str.lower)
df['city'].drop_duplicates()

0      beijing
1           sh
2    guangzhou
3     shenzhen
4     shanghai
Name: city, dtype: object

In [25]:
#删除city列先出现的重复值
df['city'].drop_duplicates(keep = 'last')

1           sh
2    guangzhou
3     shenzhen
4     shanghai
5      beijing
Name: city, dtype: object

In [26]:
#数据替换,将city列中sh替换为shanghai
df['city'].replace('shanghai','SH')

0      beijing
1           sh
2    guangzhou
3     shenzhen
4           SH
5      beijing
Name: city, dtype: object

## 数据预处理

In [27]:
df1=pd.DataFrame({"id":[1001,1002,1003,1004,1005,1006,1007,1008], 
                  "gender":['male','female','male','female','male','female','male','female'],
                  "pay":['Y','N','Y','Y','N','Y','N','Y',],
                  "m-point":[10,12,20,40,40,40,30,20]})

In [28]:
#数据表df和df1匹配合并-inner方式,并将结果赋值给df_inner
#方法中的how参数可以省略,简写为pd.merge(df,df1,'inner')
df_inner = pd.merge(df,df1,'left')
df_inner

     id       date       city category  age   price  gender  m-point pay
0  1001 2013-01-02    beijing    100-A   23  1200.0    male       10   Y
1  1002 2013-01-03         sh    100-B   44  3299.5  female       12   N
2  1003 2013-01-04  guangzhou    110-A   54  2133.0    male       20   Y
3  1004 2013-01-05   shenzhen    110-C   32  5433.0  female       40   Y
4  1005 2013-01-06   shanghai    210-A   34  3299.5    male       40   N
5  1006 2013-01-07    beijing    130-F   32  4432.0  female       40   Y

In [29]:
#尝试用left,right.outer方式合并数据,分别赋值给df_left,df_right,df_outer

In [30]:
#为df_inner设置索引列为id
df_inner.set_index('id')

           date       city category  age   price  gender  m-point pay
id
1001 2013-01-02    beijing    100-A   23  1200.0    male       10   Y
1002 2013-01-03         sh    100-B   44  3299.5  female       12   N
1003 2013-01-04  guangzhou    110-A   54  2133.0    male       20   Y
1004 2013-01-05   shenzhen    110-C   32  5433.0  female       40   Y
1005 2013-01-06   shanghai    210-A   34  3299.5    male       40   N
1006 2013-01-07    beijing    130-F   32  4432.0  female       40   Y

In [31]:
#按age列进行排序
df_inner.sort_values('age')

     id       date       city category  age   price  gender  m-point pay
0  1001 2013-01-02    beijing    100-A   23  1200.0    male       10   Y
3  1004 2013-01-05   shenzhen    110-C   32  5433.0  female       40   Y
5  1006 2013-01-07    beijing    130-F   32  4432.0  female       40   Y
4  1005 2013-01-06   shanghai    210-A   34  3299.5    male       40   N
1  1002 2013-01-03         sh    100-B   44  3299.5  female       12   N
2  1003 2013-01-04  guangzhou    110-A   54  2133.0    male       20   Y

In [32]:
#按索引列排序
df_inner.sort_index()

     id       date       city category  age   price  gender  m-point pay
0  1001 2013-01-02    beijing    100-A   23  1200.0    male       10   Y
1  1002 2013-01-03         sh    100-B   44  3299.5  female       12   N
2  1003 2013-01-04  guangzhou    110-A   54  2133.0    male       20   Y
3  1004 2013-01-05   shenzhen    110-C   32  5433.0  female       40   Y
4  1005 2013-01-06   shanghai    210-A   34  3299.5    male       40   N
5  1006 2013-01-07    beijing    130-F   32  4432.0  female       40   Y

###数据分组

In [33]:
#使用where方法,新建一列group,如果price列的值>3000，group列显示high，否则显示low
df_inner['group'] = np.where(df_inner['price']>3000,'high','low')
df_inner

     id       date       city category  age   price  gender  m-point pay group
0  1001 2013-01-02    beijing    100-A   23  1200.0    male       10   Y   low
1  1002 2013-01-03         sh    100-B   44  3299.5  female       12   N  high
2  1003 2013-01-04  guangzhou    110-A   54  2133.0    male       20   Y   low
3  1004 2013-01-05   shenzhen    110-C   32  5433.0  female       40   Y  high
4  1005 2013-01-06   shanghai    210-A   34  3299.5    male       40   N  high
5  1006 2013-01-07    beijing    130-F   32  4432.0  female       40   Y  high

In [34]:
#使用loc方法,新建sign列,如果price列的值>4000且city列=='beijing',则标记为1
#df.loc的第一个参数是行标签，第二个参数为列标签（可选参数，默认为所有列标签），两个参数既可以是列表也可以是单个字符，如果两个参数都为列表则返回的是DataFrame，否则，则为Series。
#http://blog.csdn.net/chixujohnny/article/details/51095817
df_inner.loc[(df_inner['city'] =='beijing')& (df_inner['price']> 4000),'sign'] = 1
df_inner

,id,date,city,category,age,price,gender,m-point,pay,group,sign
0,1001,2013-01-02,beijing,100-A,23,1200.0,male,10,Y,low,NaN
1,1002,2013-01-03,sh,100-B,44,3299.5,female,12,N,high,NaN
2,1003,2013-01-04,guangzhou,110-A,54,2133.0,male,20,Y,low,NaN
3,1004,2013-01-05,shenzhen,110-C,32,5433.0,female,40,Y,high,NaN
4,1005,2013-01-06,shanghai,210-A,34,3299.5,male,40,N,high,NaN
5,1006,2013-01-07,beijing,130-F,32,4432.0,female,40,Y,high,1.0

###数据分列

In [35]:
#对category字段的值依次进行分列，并创建数据表，索引值为df_inner的索引列，列名称为category和size
temp = pd.DataFrame([x.split('-') for x in df_inner['category']],columns = ['category1','type'],index = df_inner.index)
temp

  category1 type
0       100    A
1       100    B
2       110    A
3       110    C
4       210    A
5       130    F

In [36]:
pd.DataFrame([(x,x**2) for x in range(3)],columns = ['a','b'],index = ['yi','er','san'])

     a  b
yi   0  0
er   1  1
san  2  4

In [37]:
#

In [38]:
#将完成分列后的数据表与原df_inner数据表进行匹配
df_inner = pd.merge(df_inner,temp,right_index = True,left_index = True)
df_inner

,id,date,city,category,age,price,gender,m-point,pay,group,sign,category1,type
0,1001,2013-01-02,beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
1,1002,2013-01-03,sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2,1003,2013-01-04,guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A
3,1004,2013-01-05,shenzhen,110-C,32,5433.0,female,40,Y,high,NaN,110,C
4,1005,2013-01-06,shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
5,1006,2013-01-07,beijing,130-F,32,4432.0,female,40,Y,high,1.0,130,F

##数据提取

###按标签提取(loc)

In [39]:
#按索引提取单行的数值
df_inner.loc[1:]

,id,date,city,category,age,price,gender,m-point,pay,group,sign,category1,type
1,1002,2013-01-03,sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2,1003,2013-01-04,guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A
3,1004,2013-01-05,shenzhen,110-C,32,5433.0,female,40,Y,high,NaN,110,C
4,1005,2013-01-06,shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
5,1006,2013-01-07,beijing,130-F,32,4432.0,female,40,Y,high,1.0,130,F

In [40]:
#按索引提取区域行数值
df_inner.loc[:,'price']

0    1200.0
1    3299.5
2    2133.0
3    5433.0
4    3299.5
5    4432.0
Name: price, dtype: float64

In [41]:
#重设索引
df_inner.reset_index()

,index,id,date,city,category,age,price,gender,m-point,pay,group,sign,category1,type
0,0,1001,2013-01-02,beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
1,1,1002,2013-01-03,sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2,2,1003,2013-01-04,guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A
3,3,1004,2013-01-05,shenzhen,110-C,32,5433.0,female,40,Y,high,NaN,110,C
4,4,1005,2013-01-06,shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
5,5,1006,2013-01-07,beijing,130-F,32,4432.0,female,40,Y,high,1.0,130,F

In [42]:
#设置日期date为索引
df_inner.set_index('date')

,id,city,category,age,price,gender,m-point,pay,group,sign,category1,type
date,,,,,,,,,,,,
2013-01-02,1001,beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
2013-01-03,1002,sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2013-01-04,1003,guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A
2013-01-05,1004,shenzhen,110-C,32,5433.0,female,40,Y,high,NaN,110,C
2013-01-06,1005,shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A
2013-01-07,1006,beijing,130-F,32,4432.0,female,40,Y,high,1.0,130,F

In [43]:
#提取4日2013-01-04之前的所有数据
#注意比较以下两个语句的差别
df_inner[:3]
df_inner.loc[:'44']

,id,date,city,category,age,price,gender,m-point,pay,group,sign,category1,type
0,1001,2013-01-02,beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
1,1002,2013-01-03,sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2,1003,2013-01-04,guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A
3,1004,2013-01-05,shenzhen,110-C,32,5433.0,female,40,Y,high,NaN,110,C
4,1005,2013-01-06,shanghai,210-A,34,3299.5,male,40,N,high,NaN,210,A

In [78]:
#使用iloc按位置区域提取数据---前三行,前两列
df_inner.iloc[:4]

,id,date,city,category,age,price,gender,m-point,pay,group,sign,category1,type
0,1001,2013-01-02,beijing,100-A,23,1200.0,male,10,Y,low,NaN,100,A
1,1002,2013-01-03,sh,100-B,44,3299.5,female,12,N,high,NaN,100,B
2,1003,2013-01-04,guangzhou,110-A,54,2133.0,male,20,Y,low,NaN,110,A
3,1004,2013-01-05,shenzhen,110-C,32,5433.0,female,40,Y,high,NaN,110,C

In [79]:
#使用iloc按位置单独提取数据---0,2,5行,4,5列
df_inner.iloc[[0,2,5],[4,5]]

   age   price
0   23  1200.0
2   54  2133.0
5   32  4432.0

In [46]:
#使用ix按索引标签和位置混合提取数据-------2013-1-3之前,4列

###按条件提取

In [47]:
#判断city列的值是否为beijing

In [48]:
#先判断city列里是否包含beijing和shanghai，然后将复合条件的数据提取出来。

In [49]:
#将category列密码的数值单独赋值给category

In [50]:
#提取category的前三个字符生成DataFrame

##数据筛选

In [51]:
#使用“与”条件进行筛选

In [52]:
#使用“或”条件筛选

In [53]:
#对筛选后的数据按price字段进行求和

In [54]:
#使用“非”条件进行筛选

In [55]:
#对筛选后的数据按city列进行计数

In [56]:
#使用query函数进行筛选

In [57]:
#对筛选后的结果按price进行求和

##分类汇总

In [58]:
#对所有列进行计数汇总

In [59]:
#对特定的ID列进行计数汇总

In [60]:
#对两个字段进行汇总计数

In [61]:
#对city字段进行汇总并计算price的合计和均值。

###数据透视表

In [62]:
#数据透视表

In [63]:
#简单的数据采样

In [64]:
#手动设置采样权重

In [65]:
#采样后不放回

In [66]:
#数据表描述性统计

In [67]:
#标准差

In [68]:
#两个字段间的协方差

In [69]:
#数据表中所有字段间的协方差

In [70]:
#相关性分析

In [71]:
#数据表相关性分析

In [72]:
#输出到Excel格式

In [73]:
#输出到CSV格式